{
    "privacy_policy": {
        "content": "<h1>Personal Information We Collect</h1><p><strong>We collect personal information about you (Personal Information) as follows:</strong></p><h2>Account Information</h2><p>When you create an account on <a href=\"https://rithub.org/\">RIT Engine</a>, we collect critical information about your account that is necessary to operate our Services. This information includes your full name, contact information such as email address and phone number, as well as your account validation details. This data allows us to properly manage your account and ensure that your user experience on our platform is smooth.</p><p>In addition, information related to your payment instruments, such as payment card information, is carefully collected and maintained. This information is only used to process payments related to the services you receive from <a href=\"https://rithub.org/\">RIT Engine</a>. We employ advanced security measures to protect your financial information from unauthorized access and misuse, ensuring the security of this data is a high priority for us.</p><p>Finally, the history of your transactions is also recorded and maintained so that we can provide you with full financial and service support. This information helps us better understand your needs and provide better services tailored to your requirements. Additionally, in case of disputes or questions related to transactions, this record serves as a reliable reference.</p><h2>User Content</h2><p>At <a href=\"https://rithub.org/\">RIT Engine</a>, we value the importance of user input, file uploads, and feedback. This personal information, provided directly to us by users, is a vital part of the data that helps us to optimally adapt and improve our services. User inputs can include text, comments, suggestions, and other forms of direct participation, all of which are recorded in interactions with our systems.</p><p>When you upload files to the system, such as documents, images, videos, and other types of files, this content is saved as part of your user profile. This information allows us to provide a more personalized experience and more accurately identify and anticipate your needs. Also, your feedback and input are key to the development of new products and services, as your comments directly influence our improvement and innovation process.</p><p>In addition, respecting your privacy is at the heart of our policies. We ensure that all personal information collected, including entries and uploaded content, is protected and maintained to the highest security standards. We are committed to transparency in the use of this data, and users will always be able to access and manage their information, enabling them to make informed decisions about how to use our services.</p><h2>Automatically Collected Information</h2><p>When users interact with our Services, various information is automatically collected to enhance user experience and provide our services more effectively. This data includes users' IP addresses, browser type and settings, date and time of each request to our servers, and details of users' interactions with the site. Collecting this information helps us identify and address potential technical issues, as well as analyze and enhance site performance.</p><p>The obtained data allow us to continuously analyze the quality of users' experience, enabling us to provide services that are not only functional and efficient but also ensure the security and privacy of users. For example, analyzing IP addresses and browser settings can help us identify unusual or suspicious usage patterns that may indicate security concerns.</p><p>In addition, utilizing this information automatically enables our services to be continuously optimized. By analyzing the collected data, we can reduce redundancy, enhance how users interact with various features of the site, and ensure that our services are always available and reliable. This process not only enhances the speed and efficiency of the website but also significantly improves the user experience.</p><h2>Retention of Contact Information</h2><p>We meticulously maintain contact information and utilize it to respond to inquiries, address concerns, and communicate with you. This information is vital for managing customer relationships and enhancing service quality.</p><h2>Privacy in Communication Information</h2><p>We pay special attention to the privacy and security of your communication information. None of your contact information will be transferred to other individuals or organizations and will only be used for service-related purposes.</p><h2>Social Media Information</h2><p>When you interact with our social media pages, information such as your contact details is collected. The companies that host these pages may provide aggregated and analytical information about our activities.</p> <h2>Other Information You Provide</h2><p>Information that you provide when participating in our events or surveys or when verifying your identity.</p><h2>Aggregated or Anonymized Information</h2><p>We may aggregate or anonymize your personal information so that you are no longer identifiable. This information is used to analyze the effectiveness of our services, add features, conduct research, and for similar purposes. We may share or disclose this information with third parties.</p><h2>Additional Disclosures</h2><p>We do not sell your personal information for advertising purposes.</p><p><strong>Authentication:</strong> To safeguard your personal information from unauthorized access, alteration, or deletion, we may need to verify your credentials.</p><p><strong>International Users:</strong> Your personal information may be processed and stored at our facilities and servers in Switzerland or other jurisdictions.</p><h2>Changes to the Privacy Policy</h2><p>We may update this privacy policy and will post the new version on this page.</p><h3>How to Contact Us:</h3><p>If you have any questions or concerns, please contact us via email at <a href=\"mailto:support@rithub.org\">support@rithub.org</a>.</p><p style=\"color:#fcc930\">This documentation is only supported until version 1</p>"
    },
    "user_guide": {
        "content": "<h1> Error management: </h1><p>- HTTP Error 404 (Not Found): This error occurs when the requested page cannot be found, usually due to entering the wrong address or clicking on an invalid link.</p><p>Solution: Ensure the URL is entered correctly.</p><p>- HTTP Error 500 (Internal Server Error): This error occurs due to server problems beyond the user's control.</p><p>Solution: Wait a few minutes and try again. If the problem persists, contact the support team using the provided support access link.</p><p>- HTTP Error 401 (Unauthorized): This error occurs when a request is sent without proper authentication credentials.</p><p>Solution: Verify that you are logged into your account. If the problem continues, log back in and check your login information.</p><p>- HTTP Error 403 (Forbidden): This error indicates that the server detected the request but refuses to implement it because the user lacks permission to access the desired resource.</p><p>Solution: Check if you have the necessary access for the requested resource. If needed, contact your system administrator to review or adjust your permissions.</p><p>- HTTP Error 408 (Request Timeout): This error occurs when the server waits a long time to receive a request from the browser.</p><p>Solution: This error is usually caused by poor internet connection or network issues. Ensure a stable internet connection and resubmit your request.</p><h1> Common problems: </h1><p>- Delay in loading pages: This problem can occur due to heavy traffic or technical issues on the server.</p><p>Solution: Reload the page or try again later. Using a more stable internet connection can also help.</p><p>- Problems registering or logging in: Users may encounter errors when logging in or registering.</p><p>Solution: Ensure all required fields are filled and information is entered correctly. Double-check the accuracy of your information.</p><h1> Patent search optimization: </h1><p>Tip: Use specific keywords related to your invention for effective patent searches.</p><h1> Using creative techniques: </h1><p>Tip: Regularly employ creative techniques like Brainstorming or SCAMPER to develop and improve your ideas.</p><p>Trick: When using the SCAMPER technique, try applying it to every letter (Substitute, Combine, Adapt, Modify, Put to another use, Eliminate, Reverse). Ask at least one question about how you can change your idea.</p><h1> Data management and maintenance: </h1><p>Tip: To keep research data organized and easily accessible, always save data with accurate labels and complete descriptions.</p><p>Tip: Utilize project and data management tools like Trello or Google Drive to store and access information easily.</p><h1> Preparation to present and defend the invention: </h1><p>Before presenting the invention to any entity or person, ensure that your documentation and presentation are fully prepared.</p><p style=\"color:#fcc930\">This documentation is only supported until version 1</p>"
    },
        "terms_of_use": {
        "content": "<p>In accordance with <a href=\"https://rithub.org/\">RIT Engine</a>'s privacy policies, we are dedicated to safeguarding the privacy and security of our users' personal information. This privacy policy outlines the details of the information we collect, how we utilize it, and the measures we take to protect your data.</p><h2> Information Collection </h2><p>We may gather users' personal information through various means, including:</p><h3>1. Personalizing the user experience:</h3><p>We employ meticulously collected information to personalize the user experience, providing you with the utmost satisfaction and best experience. By analyzing your data, we gain insight into your behaviors, preferences, and needs, enabling us to enhance the content and features of our service accordingly. This entails providing tailored content suggestions based on your interests, customizing the user interface to suit your requirements, and offering tools and features that are specifically beneficial and efficient for you. We utilize this method to enhance your user experience, ensuring that you derive maximum benefit from our service and that your needs are met optimally.</p><br><h3>2. Improving our service</h3><p>We utilize your data to enhance our service. Through careful analysis of user data, we strive to improve the performance, efficiency, and features of our AI service. This information aids us in enhancing our service, identifying existing issues, and taking proactive measures to address challenges. Our objective in undertaking these efforts is to offer you a superior and more effective experience, ensuring that our service consistently aligns with your needs and expectations, providing you with the utmost level of service.</p><br><h3>3. Communication with Users</h3><p>Regarding communication with users, we utilize the contact information they provide to address inquiries, offer support, and send pertinent updates and notifications. These communications enable us to respond to users' needs and queries, ensure prompt resolution of any concerns or questions they may have, and keep them informed with relevant updates and announcements. This active and ongoing communication with users is of utmost importance, allowing us to deliver services in the most optimal manner and meet their needs effectively.</p><br><h3>4. Data security</h3><p>Safeguarding data is of utmost importance to us, and we employ multiple security measures to protect users' personal information. We utilize encryption protocols employed by reputable companies to secure your information during transmission and storage, ensuring its safeguarding against unauthorized access while in transit. Moreover, access to your information is restricted to qualified individuals, and we continuously monitor system activity and user behavior to identify any unusual or suspicious activity. Additionally, we provide training programs to users to educate them on effective privacy protection and information security practices. With regular security updates and dedicated security labs, we strive to provide optimal protection for your information, ensuring the safety of your personal data with us.</p><br><h3>5. Information sharing</h3><p>We affirmatively state that we neither sell, trade, nor rent users' personal information in any manner. We place strong emphasis on respecting the privacy and security of users' personal information and do not disclose any personal information to third parties without explicit user consent. However, for analytical purposes and to enhance our services, we may share aggregated demographic information that is not linked to any personally identifiable information with our partners and affiliates. These analytical measures strictly adhere to prevailing privacy protection laws and regulations, ensuring that any shared information is used solely for specific and valid purposes and always maintained in accordance with relevant legal standards and regulations.</p><br><h3>6. Adherence to legal obligations</h3><p>We hold utmost respect for recognized legal obligations and consistently adhere to them. In compliance with applicable laws or valid requests from government authorities, we may disclose users' personal information. Such disclosures occur solely when required by governing laws and regulations, typically in cases involving law enforcement or judicial rulings. We strictly adhere to local and international laws, ensuring that any information disclosed is done so in accordance with legal mandates and in full compliance with privacy regulations and users' rights.</p><br><h3>7. Privacy Policy</h3><p>We exercise due diligence and retain the right to update or modify this Privacy Policy as needed. Any changes or updates to this Privacy Policy will be posted on this page, and users are encouraged to periodically review it for any revisions.</p><br><h3>8. Acceptance of Terms</h3><p>By utilizing our AI Service, users indicate their acceptance of the terms outlined in this Privacy Policy. If you do not agree with this policy, kindly refrain from using our service. Continuing to use our AI Platform after any changes or updates to this Privacy Policy signifies acknowledgment and acceptance of the revised terms.</p><br><h3>9. Contacting Us</h3><p>Should you have any questions or concerns regarding this Privacy Policy or the manner in which we utilize our AI Service, please reach out to us at support@rithub.org. This Privacy Policy is current and was last updated on May 12, 2024.</p><h2> Terms and Conditions </h2><p>These terms and conditions (\"Terms\") govern the use of the <a href=\"https://rithub.org/\">RIT Engine</a>, an artificial intelligence service (Service), provided by the IFIA Research Innovation Teams Department. By accessing or using this service, you agree to these terms. If you do not agree with any part of these Terms, you may not use the Service.</p><h2> 1. Use of the service </h2><p><strong>a.</strong> To use the service, you must be at least 12 years old.</p><p><strong>b.</strong> By using the Service, you agree to use it only for lawful purposes and in accordance with these Terms.</p><p><strong>c.</strong> You acknowledge that the Service is provided on an \"as is\" and \"as available\" basis, and IFIA Research Innovation Teams Department makes no warranties or guarantees as to its accuracy, reliability, or suitability for any purpose.</p><h2> 2. Intellectual Property </h2><p><strong>a.</strong> This service and all content related to the <a href=\"https://rithub.org/\">RIT Engine</a>, including the platform, algorithms, and service documentation, are owned by the IFIA Research Innovation Teams Department and are protected by intellectual property laws. This legal protection ensures the rights of the IFIA Research Innovation Teams Department against any misuse or infringement of rights.</p><p><strong>b.</strong> You are not permitted to reproduce, distribute, modify, or create derivative works from this Service without the express written permission of the IFIA Research Innovation Teams Department. Violation of these regulations may result in legal action and make you liable for damages or penalties. Additionally, the IFIA Research Innovation Teams Department may restrict your access to the Service if any violations of the Terms are identified, in order to safeguard their intellectual property and creative rights.</p><p><strong>c.</strong> Your use of this service must always respect the intellectual property rights of the IFIA Research Innovation Teams Department. You must refrain from engaging in any activity that directly or indirectly infringes upon copyright, trademark, design rights, or any other intellectual property rights.</p><p><strong>d.</strong> Any commercial use of this service or its contents is only permitted with prior written permission from the IFIA Research Innovation Teams Department. Requests for such permission must be made through the official communication channels designated by the IFIA Research Innovation Teams Department. Unauthorized commercial use of this service may result in severe legal and criminal consequences.</p><p><strong>e.</strong> You agree not to attempt to crack, circumvent, or violate the security measures of the Service, which are in place to protect the intellectual property content of the IFIA Research Innovation Teams Department. Any efforts to manipulate or bypass these measures may lead to legal prosecution.</p><p><strong>f.</strong> While using the Service, you must ensure that all software, algorithms, and related documentation, which are protected by intellectual property laws, remain unaltered unless you have obtained explicit permission to modify them from the IFIA Research Innovation Teams Department.</p><p><strong>g.</strong> If you intend to share content related to this service for educational or research purposes, you must obtain prior written consent from the IFIA Research Innovation Teams Department. This requirement is in place to safeguard intellectual property rights and prevent inappropriate use of sensitive content.</p><p><strong>h.</strong> It is strictly prohibited to display, broadcast, or publish any part of this service on social networks, websites, or other platforms without the written permission of the IFIA Research Innovation Teams Department. This includes any video, image, or text that may contain content protected under intellectual property laws.</p><p><strong>i.</strong> You agree to use the IFIA Research Innovation Teams Department brand name and trademark appropriately and in accordance with the IFIA Research Innovation Teams Department brand guidelines in any advertising or promotional materials that feature this IFIA Research Innovation Teams Department service. Failure to adhere to these guidelines may result in legal action against you.</p><h2> 3. User Behavior </h2><p><strong>j.</strong> IFIA Research Innovation Teams Department shall not be held liable for any damages resulting from data loss or lost profits, even if IFIA Research Innovation Teams Department has been informed of the possibility of such damages.</p><p><strong>k.</strong> IFIA Research Innovation Teams Department shall not be held liable for any delay or failure to perform its obligations due to circumstances beyond its reasonable control, including but not limited to acts of God, war, terrorism, rebellion, embargo, actions of civil or military authorities, fire, flood, accidents, or lack of transportation.</p><p><strong>l.</strong> IFIA Research Innovation Teams Department shall not be responsible for any damages incurred specifically by commercial users as a result of the use or inability to use this service.</p><p><strong>m.</strong> IFIA Research Innovation Teams Department shall not be liable for any claims of intellectual property rights infringement arising from your use of this service.</p><p><strong>n.</strong> IFIA Research Innovation Teams Department is not responsible for damages caused by malware, viruses, or other malicious code that may harm your system.</p><p><strong>o.</strong> IFIA Research Innovation Teams Department will not be held responsible for any damages resulting from the user's reliance on the information provided by this service.</p><p><strong>p.</strong> None of the aforementioned provisions shall limit or reduce IFIA Research Innovation Teams Department's liability in any way contrary to the obligations imposed by local binding laws.</p><h2> 4. Commitment to Compensation </h2><p><strong>a.</strong> You agree to indemnify and hold IFIA Research Innovation Teams Department, its affiliates, and their directors, employees, and agents harmless from any claims, damages, liabilities, costs, or expenses arising from your use of this service or your violation of these terms and conditions. This commitment includes the obligation to cover any legal fees and other expenses incurred by the IFIA Research Innovation Teams Department in defending such claims. By accepting these terms, you acknowledge that you are fully responsible for your use of this service and for complying with the related rules and regulations. In the event that your use results in damage or loss to IFIA Research Innovation Teams Department or any other party, you are obligated to provide compensation for such damages.</p><h2> 5. Commitment to Compensation </h2><p><strong>a.</strong> You agree to indemnify and hold IFIA Research Innovation Teams Department, its affiliates, and their directors, employees, and agents harmless from any claims, damages, liabilities, costs, or expenses arising from your use of the Service or your breach of these Terms.</p><p><strong>b.</strong> You agree to bear the legal defense costs of IFIA Research Innovation Teams Department in the event of any legal claims arising from your use of this service.</p><p><strong>c.</strong> This commitment includes protecting IFIA Research Innovation Teams Department against any claims of infringement of intellectual property rights related to your use of the Service.</p><p><strong>d.</strong> You also agree to indemnify IFIA Research Innovation Teams Department against any claims for unintentional or accidental damages caused to others.</p><p><strong>e.</strong> This indemnification obligation includes costs associated with claims arising from your improper or unauthorized use of the Service.</p><p><strong>f.</strong> You are also responsible for any hidden, indirect, or consequential damages arising from your use or misuse of this service.</p><p><strong>g.</strong> This commitment includes protecting IFIA Research Innovation Teams Department from any damages resulting from legal judgments or penalties imposed on IFIA Research Innovation Teams Department due to your use of this service.</p><p><strong>h.</strong> You warrant that you will indemnify and defend IFIA Research Innovation Teams Department against such claims in the event of a claim by a third party due to your activities.</p><p><strong>i.</strong> Your obligation to compensate for damages applies irrespective of the cause or principle of liability arising from your use of this service.</p><p><strong>j.</strong> You also agree to cover the costs and damages associated with a lawsuit if you violate these terms of use of the Service.</p><h2> 6. Termination of Access </h2><p><strong>a.</strong> IFIA Research Innovation Teams Department has the authority to suspend or terminate your access to this service at any time, with or without reason and without prior notice.</p><p><strong>b.</strong> This action may be taken if there is a violation of the terms of use, security concerns, or any other reason deemed appropriate by IFIA Research Innovation Teams Department.</p><p><strong>c.</strong> In the event of suspension or termination of access, IFIA Research Innovation Teams Department shall not be responsible for any loss or damage incurred by you.</p><p><strong>d.</strong> IFIA Research Innovation Teams Department may temporarily or permanently terminate your access if it determines that your behavior may harm this service or other users.</p><p><strong>e.</strong> If access is terminated due to a breach of the Terms, you will not be entitled to any refund of fees paid.</p><p><strong>f.</strong> IFIA Research Innovation Teams Department may terminate your access to this service upon the expiration of the license agreement or the termination of your subscription period.</p><p><strong>g.</strong> If you believe that your access was unfairly terminated, you may request a review from the IFIA Research Innovation Teams Department.</p><p><strong>h.</strong> Temporary suspension of users' access may be necessary in the event of significant updates or changes to the Service.</p><p><strong>i.</strong> IFIA Research Innovation Teams Department will make reasonable efforts to notify you before taking any action to terminate access, except in cases of urgency.</p><p><strong>j.</strong> IFIA Research Innovation Teams Department reserves the right to delete or terminate any inactive account without prior notice if it has been inactive for an extended period of time.</p><h2> 7. Changes in Terms </h2><p><strong>k.</strong> IFIA Research Innovation Teams Department retains the right to modify or revise these terms at any time. Any changes will be effective immediately upon being posted on the Service. Your continued use of this service after the changes are posted constitutes your acceptance of the revised terms.</p><p><strong>l.</strong> IFIA Research Innovation Teams Department will make reasonable efforts to notify you through email or internal notifications within the service prior to implementing any changes.</p><p><strong>m.</strong> If you do not agree with the modified terms, you have the right to refuse the use of this service and close your account.</p><p><strong>n.</strong> Changes may include updates to the Service's features, adjustments to the Terms of Use, and modifications to users' rights and responsibilities.</p><p><strong>o.</strong> IFIA Research Innovation Teams Department may also make changes to its privacy policies that directly affect the collection, use, and disclosure of your personal data.</p><p><strong>p.</strong> The changes are implemented to enhance the services provided to users and comply with new rules and regulations.</p><p><strong>q.</strong> All changes to the terms and conditions are automatically applicable and do not require users' reconfirmation.</p><p><strong>r.</strong> IFIA Research Innovation Teams Department strives to ensure that users are well-informed about the changes and have the opportunity to review the new terms.</p><p><strong>s.</strong> Any disputes arising from the modified terms will be resolved under the same rules governing the previous terms and conditions.</p><p><strong>t.</strong> Users are responsible for regularly reviewing the Terms and Conditions to stay informed about any changes that may impact their use of the Service.</p><h2> 8. Contact Information </h2><p><strong>a.</strong> If you have any questions or concerns regarding these Terms, please contact us at [engine@rithub.org].</p><p><strong>b.</strong> These terms were last updated on [date].</p><p><strong>c.</strong> Our contact information is available to provide support and guidance regarding the use of this service.</p><p><strong>d.</strong> To receive a prompt response, please clearly state the subject of your message in the email subject line.</p><p><strong>e.</strong> We are committed to addressing your questions promptly and accurately.</p><p><strong>f.</strong> If you would like to provide feedback or suggestions, you can use the provided email address.</p><p><strong>g.</strong> We appreciate your feedback and comments as they help us improve our services.</p><p><strong>h.</strong> We will make every effort to respond to you as soon as possible.</p><p><strong>i.</strong> When sending an email, please provide sufficient information for us to effectively address your questions.</p><p><strong>j.</strong> If any important changes or updates are necessary, we will use this communication method to notify you.</p><p style=\"color:#fcc930\">This documentation is only supported until version 1</p>"
    },
    "share_safety": {
        "content": "Share Safety"
    },
    "license": {
        "content": "<h1><a href=\"https://rithub.org/\">RIT Engine</a> License Agreement</h1> <h2>1. License Grant</h2> <p>IFIA Research Innovation Teams (Licensor) grants the Licensee a non-exclusive, non-transferable license to use the <a href=\"https://rithub.org/\">RIT Engine</a> (Software) solely for <em>[personal/commercial/educational]</em> purposes related to invention development and research.</p> <h2>2. Restrictions</h2> <p>The Licensee agrees not to:</p> <ul> <li>Distribute, sublicense, or resell the Software.</li> <li>Modify, reverse engineer, or create derivative works of the Software.</li> <li>Use the Software in any manner that violates intellectual property rights or other legal requirements related to inventions.</li> </ul> <h2>3. Intellectual Property</h2> <p>All rights to the <a href=\"https://rithub.org/\">RIT Engine</a>, including any updates, modifications, and enhancements, remain the sole property of IFIA Research Innovation Teams. This Agreement does not transfer any intellectual property rights to the Licensee.</p> <h2>4. Termination</h2> <p>This Agreement is effective until terminated. The Licensee may terminate the license by discontinuing use of the Software. The Licensor may terminate this license if the Licensee fails to comply with any terms of this Agreement.</p> <h2>5. Disclaimer of Warranties</h2> <p>The <a href=\"https://rithub.org/\">RIT Engine</a> is provided \"as is,\" without warranties of any kind, either express or implied. The Licensor makes no guarantees that the Software is error-free, suitable for invention-related tasks, or fit for any particular purpose.</p> <h2>6. Limitation of Liability</h2> <p>IFIA Research Innovation Teams shall not be liable for any damages arising from the use of the <a href=\"https://rithub.org/\">RIT Engine</a>, including any issues related to invention development, data loss, or loss of profits.</p><p style=\"color:#fcc930\">This documentation is only supported until version 1</p>"
    }
}